1C_Final/DataProcessors/ПереносПриборовИзКвартир.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПереносПриборовИзКвартир</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

1C_Final/Catalogs/ПриборыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПриборыУчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СведенияОДомах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПрибора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СведенияОДомах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МежповерочныйИнтервалЛет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1C_Final/DataProcessors/ПереносПриборовИзКвартир/Ext/ObjectModule.bsl
Процедура ВыполнитьПеренос() Экспорт

    ВыборкаКвартир = Справочники.Квартиры.Выбрать();
    
    Пока ВыборкаКвартир.Следующий() Цикл
        
        Кв = ВыборкаКвартир.Ссылка;
        
        Для каждого Стр Из Кв.ПриборыУчета Цикл
            
            НовыйПрибор = Справочники.ПриборыУчета.СоздатьЭлемент();
            
            // Наименование для удобства
            НовыйПрибор.Наименование = "Прибор кв. " 
                + Кв.Наименование 
                + ", строка " 
                + Формат(Стр.НомерСтроки, "ЧГ=0");
            
            // Привязка к объекту учета - к квартире
            НовыйПрибор.ОбъектУчета = Кв;
            
            НовыйПрибор.ДатаПроизводства      = Стр.ДатаПроизводства;
            НовыйПрибор.ДатаУстановки        = Стр.ДатаУстановки;
            НовыйПрибор.ДатаПоследнейПоверки = Стр.ДатаПоследнейПоверки;
            
            // Переводим дату интервала в количество лет
            Если ЗначениеЗаполнено(Стр.МежповерочныйИнтервалГод) Тогда
                НовыйПрибор.МежповерочныйИнтервалЛет =
                    Год(Стр.МежповерочныйИнтервалГод)
                    - Год(НачалоГода(Стр.МежповерочныйИнтервалГод));
            КонецЕсли;
            
            НовыйПрибор.Записать();
            
        КонецЦикла;
        
    КонецЦикла;
    
    Сообщить("Перенос приборов из квартир завершен.");

КонецПроцедуры
